app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.from_omniauth(access_token)
    data = access_token.info
    user = User.where(email: data['email']).first